{
	"resume": {
		"contact" : {
			"first_name": "Jeremy",
			"last_name": "DAGORN",
			"website": "http://www.jeremydagorn.com",
			"email": "jeremy.dagorn@gmail.com",
			"github": "http://github.com/jrm2k6",
			"city": "San Diego"
		},

		"education": [
			{
				"item-education": {
					"start-date": "Sep, 2011",
					"end-date": "May, 2012",
					"institution": {
						"name": "Laval University",
						"city": "Quebec City",
						"country": "Canada"
					},
					"description": "Exchange student in software engineering and computer science",
					"additional-info": "Graduating with the equivalent of a Master Degree in Computer Science",
					"id": "item-education-laval",
					"extra": {
						"type": "text",
						"extraContent": "This is when I started to discover an interest for programming. On my free time I started to work on my first website, using Ruby on Rails. You can still find the source on <a href=\"https://github.com/jrm2k6/portfolio-old\"> Github</a>."
					}
				}
			},
			{
				"item-education": {
					"start-date": "Sep, 2009",
					"end-date": "Oct, 2012",
					"institution": {
						"name": "Engineering School of University of Nantes",
						"city": "Nantes",
						"country": "France"
					},
					"description": "Student in Software Engineering and Networks",
					"additional-info": "Graduated with the equivalent of a Master Degree in Computer Science",
					"extra": {
						"type": "text",
						"extraContent": "Fun fact: my first Android app was a shopping list application for a school project. <br /> Done in collaboration with <a href=\"https://twitter.com/atomrc\">@atomrc</a> at the time."
					},
					"id": "item-education-polytech"
				}
			},
			{
				"item-education": {
					"start-date": "Sep, 2006",
					"end-date": "May, 2009",
					"institution": {
						"name": "University of South Brittany",
						"city": "Vannes",
						"country": "France"
					},
					"description": "Student in Computer Science",
					"additional-info": "Graduated with a Bachelor Degree in Computer Science with honors"
				}
			}
		],
		"work": [
			{
				"item-work": {
					"start-date": "Jan. 2015",
					"end-date": "Present",
					"position": "Full-stack engineer",
					"company": {
						"name": "Curology",
						"city": "San Diego",
						"country": "USA"
					},
					"achievements": "Curology aims at making dermatologists accessible easily, and for cheap, in the USA. We have a full-stack platform to help reaching this goal (dermatologists, in-house lab, shipping system). To do so, I have been working on projects related to each of those areas, wearing multiple hats. Those projects can go from creating a support center in React.js, to implement a complex signup flow in Ember.js, making the process fun and dynamic for our users. I have also been working on creating our whole testing infrastructure (unit, integration, screenshots comparison) to make sure we could move fast while keep a consistent quality. On a side note, I was also the organizer of the San Diego React.js meetup. We were meeting once a month at the Curology offices.",
					"technologies": [
						"PHP/Laravel",
						"Javascript",
						"React.js",
						"React Native",
						"Ember.js"
					]
				}
			},
			{
				"item-work": {
					"start-date": "May. 2012",
					"end-date": "Sep. 2014",
					"position": "Software engineer",
					"company": {
						"name": "Prezi.com",
						"city": "Budapest",
						"country": "Hungary"
					},
					"achievements": "During my two years at Prezi, I have been part of several teams. I started as a developer in charge of implementing new features for the Prezi editor, in order to increase the number of reccurring users. Then, I joined the Collaboration team where I implemented complex user interfaces and new features for real time editing and presenting of Prezi presentations. I also joined the Javascript team where I worked on implementing a UI framework for other developers including a lot of architectural decisions.",
					"technologies": [
						"Actionscript",
						"Javascript",
						"Typescript",
						"Haxe",
						"React.js",
						"Python"
					],
					"id": "item-work-prezi",
					"extra": {
						"type": "text",
						"extraContent": "I learned so much during my time there. From testing to continuous deployment. <br /> Some technologies and tools that I used: <ul><li>Jenkins</li><li>Pig/Hadoop</li><li>Cucumber</li><li>Gradle</li></ul>"
					}
				}
			},
			{
				"item-work": {
					"start-date": "May, 2011",
					"end-date": "Sep, 2011",
					"position": "Intern Android Developer",
					"company": {
						"name": "UC Santa Cruz",
						"city": "Santa Cruz",
						"country": "USA"
					},
					"achievements": "I was in charge of implementing two prototypes in Android for two different projects. The first project was targeting people suffering from Aphasia. The Android application created was displaying images, with multiple choices for their meaning, or recording sentences repeated by the user. A web interface has also been implemented to provide an easy way for a therapist to follow the evolution of a patient. The second project was an electronic calendar for tablets for people with Alzeihmer. This was an easy way to study their habits by recording their interaction with the application (handwriting, and taking pictures). I also took part in the redaction of papers submitted for conferences.",
					"technologies": [
						"Android/Java",
						"PHP"
					],
					"id": "item-work-ucsc",
					"extra": {
						"type": "text",
						"extraContent": "You can find the submitted paper here and the implementation for the Electronic Calendar in the <a href=\"http://github.com/jrm2k6/ElectronicCalendar\">Github repo</a>."
					}
				}
			}
		],
		"projects": [
			{
				"item-projects": {
					"title": "Developer for iheartreading.co",
					"description":"A web app to help teachers track their students reading. The app lets them add books, update their progress and upload responses that their teachers can review. It helps the student make sure they are on track for their reading goals, and provide a way for teachers to easily track progress to give more help to student in need. It is right now used by one school in San Diego, still in testing but should have a bigger release in September. It is using the Goodreads API to fetch necessary data about books/authors.",
					"technologies": [
						"Laravel",
						"React.js/Redux"
					]
				}
			},
			{
				"item-projects": {
					"title": "Created and maintaing several open-source projects",
					"description":"Those packages are mostly in the Laravel or React.js ecosystem. They include Laravel wrappers for Reddit and Cloudinary, a markdown editor implemented in React.js and some other small projects.",
					"technologies": [
						"Laravel",
						"React.js"
					]
				}
			},
			{
				"item-projects": {
					"title": "Developer at JumyApps",
					"description":"We mainly design and develop applications on our free time. So far, we have several board games, and a Twitter client focusing on ergonomy, making your usage of Twitter easier by providing nice to use features. Entirely conceived by us, we are also in charge of promoting them through various channels.",
					"technologies": [
						"Android/Java"
					],
					"id": "id-jumyapps",
					"extra": {
						"type": "images",
						"extraContent": ["http://i.imgur.com/zbYcTsL.png", "http://i.imgur.com/1zi7bKi.png", "http://i.imgur.com/LNi89NW.png", "http://i.imgur.com/P4UGX5a.png"]
					}
				}
			},
			{
				"item-projects": {
					"title": "Creation of a NPM module: json-resume-dynamic",
					"description":"On my free time, I work on various open-source projects of my own. Those mostly includes small packages, easy to integrate. For example, this resume is generated through a npm package of my own called json-resume-dynamic. I have also a markdown editor with preview implemented in React.js that is currently used in production at Curology. I am also maintaining Reddit and Cloudinary API wrappers for Laravel, available as composer packages. My last project is a small npm package to help you generate a calendar showing all your Bitbucket and Github contributions as a React component, easy to display on your website.",
					"technologies": [
						"Javascript", "React.js", "Laravel", "Node.js", "Various APIs"
					],
					"id": "id-npm",
					"extra": {
						"type": "text",
						"extraContent": "Everything is open-source on my <a target='_blank' href='https://github.com/jrm2k6'>Github</a>"
					}
				}
			}
		],
		"skills": [
			"Javascript",
			"React.js",
			"Ember.js",
			"Laravel",
			"Android/Java",
			"Python/Flask/Django"
		],
		"languages": [
			{
				"item-languages": {
					"name": "French",
					"additional-info": "Native language"
				}
			},
			{
				"item-languages": {
					"name": "English",
					"additional-info": "Bilingual"
				}
			}
		],
		"hobbies": [
			{
				"item-hobbies": {
					"name": "Criminology",
					"id": "hobby-criminology",
					"extra": {
						"type": "text",
						"extraContent": "One of my favorite author is <a href=\"www.goodreads.com/author/show/118380.St_phane_Bourgoin\">Stephane Bourgoin</a>."
					}
				}
			},
			{
				"item-hobbies": {
					"name": "Soccer",
					"additional-info": "played competitively for more than 18 years"
				}
			},
			{
				"item-hobbies": {
					"name": "Startups",
					"id": "hobby-startup",
					"extra": {
						"type": "text",
						"extraContent": "My daily readings include: <ul><li>Hacker News</li><li>Various programming related subreddits</li><li>Netflix tech blog</li><li>Linkedin tech blog</li> </lu>and a lot of nice blog posts to read found through <a href=\"http://www.twitter.com/jrm2k6\">Twitter</a>"
					}
				}
			},
			{
				"item-hobbies": {
					"name": "Travelling"
				}
			}
		]

	}
}
